# Pandas DataFrames

<li> np.random.seed() # generating same random numbers. 
<li> df.drop(index\column, axis, inplace)
<li> df.shape(), 
<li> df.DataFrame(randn(5,4), columns, rows)
<li> df.loc('a') ; df.loc(['a','b']); df.loc(['a','b'],['x','y']
<li> df.iloc(2) #second row with index number.

Columns of the each DF is a pandas Series.

In [2]:
import numpy as np 
import pandas as pd

In [3]:
from numpy.random import randn

In [3]:
np.random.seed(101) # to get the same random numbers

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
# Move on selection, this looks like a series.
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [78]:
type(df['W']) #this is a series!

pandas.core.series.Series

In [79]:
df[['W','Y']] # when we want to select multiple columns, we need to pass a list of columns

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [80]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [81]:
#REMOVE COLuMNS
df.drop('new', axis=1)
#this is the same with df.drop(columns = 'new', inplace = True)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [87]:
#recreate the new column
df['new'] = df['W'] + df['Z']

TypeError: 'NoneType' object is not subscriptable

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
#conditional operations to DataFrames return Boolean values. 
booldf = df>0
print(df[booldf],  df[df>0], sep = '\n\n' )
# it is not that common, but we will use anyway. 
#now try to change the only True values of df.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df['W']>0 #C is False, will end up NaN value. 
df[df['W']>0] #üß°üß°üß°üß° this is much more often usage üß°üß°üß°üß°

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['Z']<0] # it will only return the row where Z column value is zero

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [30]:
resultdf = df[df['W']>0]#LONG FORM ü§ç
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
df[df['W']>0]['X']; #ü§çü§çü§çSHORT FORM conditinal selection of 'W' then choosing only 'X' ü§çü§çü§ç

In [35]:
# ‚≠ê‚≠ê‚≠êwe can also call multiple columns after conditional selection. 
df[df['W']>0][['X','Y']] # ‚≠ê‚≠ê‚≠êNOTICE the extra [] around column selection.
# ‚≠ê‚≠ê‚≠êsince we call list ['X','Y'], we need to wrap it with [ ]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [56]:
boolser = df['W']>0; #we apply conditional selection which returns boolean
result = df[boolser] #df[boolser] returns part of df where 'W' columns is positive. 
mycols = ['X','Y'] #tons of [ ] brackets, we need to practice more and more.
print(boolser, result, result[mycols], sep = '\n\n') #sep=... is used forease of use. 
#this is four step and assigning new values end up w/ memory. Thus, single step above is better. 
# but this multiple step approach is OK, especially good for beginners.

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [59]:
df[df['W']>0][['X','Y']]
#‚≠ê‚≠ê‚≠êwe put condition inside of df, returns subset of DF. Then, by using df_new[['X','Y']].

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

##### AND & OR OPERATOR FOR DATAFRAMES

In [71]:
# df[(df['W']>0) and (df['Y']>0)][['X','Y']] 
#‚ò†Ô∏è‚ò†Ô∏è‚ò†Ô∏è WHY ERROR: normal AND operator can not be used for Series of Boolean values. 
#‚úÖ‚úÖ‚úÖ Thus, we use '&' for series. 
df[ (df['W']>0) & (df['Y']>0) ]

#use | for OR

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

##### df.reset_index,  df.set_index()

In [73]:
df.reset_index(inplace = False)  # make it true to update original df.

In [75]:
newind = 'CA NY WY OR CO'.split() #nice way to create a list 
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [77]:
df['States'] = newind # Adding new column 
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO

In [78]:
df.set_index('States')

       index         W         X         Y         Z
States
CA         A  2.706850  0.628133  0.907969  0.503826
NY         B  0.651118 -0.319318 -0.848077  0.605965
WY         C -2.018168  0.740122  0.528813 -0.589001
OR         D  0.188695 -0.758872 -0.933237  0.955057
CO         E  0.190794  1.978757  2.605967  0.683509

#### Multi Index and Index Hierarchy

In [4]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #zip is used to combine two lists.
hier_index = pd.MultiIndex.from_tuples(hier_index) #this is used to create multi index.

In [14]:
pd.MultiIndex.from_tuples(list(zip(outside,inside))) #zip is a generator, we need to convert it to list.
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [17]:
df = pd.DataFrame(randn(6,2),index=hier_index, columns=['A','B'])

In [18]:
df

             A         B
G1 1  0.706582  0.438674
   2 -0.543954 -1.335325
   3 -0.259481 -0.422623
G2 1  0.546300 -0.190534
   2  0.808537 -1.075846
   3 -0.388458 -0.447859

In [25]:
df.loc['G1'].loc[1] #this is a dataframe

A    0.706582
B    0.438674
Name: 1, dtype: float64

In [27]:
df.index.names = [ 'Groups', 'Num'] #we can name the index

In [28]:
df

                   A         B
Groups Num
G1     1    0.706582  0.438674
       2   -0.543954 -1.335325
       3   -0.259481 -0.422623
G2     1    0.546300 -0.190534
       2    0.808537 -1.075846
       3   -0.388458 -0.447859

In [30]:
# lets see how thil will be useful.

df.loc['G2'].loc[2]['B']

-1.075845581593368

In [33]:
# lets try to grab 0.43 from G1 and 0.808 from G2 and assign it to a variable.
temp = [df.loc['G1'].loc[1]['B'], df.loc['G2'].loc[2]['A'] ]

In [34]:
temp

[0.43867411635851816, 0.8085365334398622]

In [35]:
df.xs('G1') #cross section, this is the same with df.loc['G1']

            A         B
Num
1    0.706582  0.438674
2   -0.543954 -1.335325
3   -0.259481 -0.422623

In [36]:
# the good thing about xs is that we can grab '1' for both G1 and G2.
df.xs(1,level='Num')

               A         B
Groups
G1      0.706582  0.438674
G2      0.546300 -0.190534